Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_FS_STM32F4xx.h
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2019 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        20. November 2019
 * $Revision:    V1.10
 *
 * Project:      OTG Full/Low-Speed Driver Header for ST STM32F4xx
 * -------------------------------------------------------------------------- */

#include <stdint.h>
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "RTE_Components.h"

#include "cmsis_compiler.h"

#include "Driver_USBH.h"
#include "Driver_USBD.h"

#ifdef    RTE_DEVICE_FRAMEWORK_CLASSIC
#include "RTE_Device.h"

// Do basic RTE configuration check
#if    (RTE_USB_OTG_FS == 1)
#if   ((RTE_USB_OTG_FS_HOST == 1) && (RTE_OTG_FS_VBUS_PIN == 0))
#error  Configure VBUS Power On/Off pin for USB OTG Full-speed in RTE_Device.h!
#endif
#else
#error  Enable USB OTG Full-speed in RTE_Device.h!
#endif

// If Framework Classic is used create MX defines from RTE defines

#ifdef RTE_Drivers_USBD0
#define MX_USB_OTG_FS_DEVICE                    1
#endif
#ifdef RTE_Drivers_USBH0
#define MX_USB_OTG_FS_HOST                      1
#endif

#define MX_USB_OTG_FS_GPIO_PIN_(n)              GPIO_PIN_##n
#define MX_USB_OTG_FS_GPIO_PIN(n)               MX_USB_OTG_FS_GPIO_PIN_(n)

// Pin USB_OTG_FS_DM : PA11
#define MX_USB_OTG_FS_DM_Pin                    PA11
#define MX_USB_OTG_FS_DM_GPIO_AF                GPIO_AF10_OTG_FS
#define MX_USB_OTG_FS_DM_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_FS_DM_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_FS_DM_GPIOx                  GPIOA
#define MX_USB_OTG_FS_DM_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_FS_DM_GPIO_Pin               GPIO_PIN_11

// Pin USB_OTG_FS_DP : PA12
#define MX_USB_OTG_FS_DP_Pin                    PA12
#define MX_USB_OTG_FS_DP_GPIO_AF                GPIO_AF10_OTG_FS
#define MX_USB_OTG_FS_DP_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_FS_DP_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_FS_DP_GPIOx                  GPIOA
#define MX_USB_OTG_FS_DP_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_FS_DP_GPIO_Pin               GPIO_PIN_12

// Pin USB_OTG_FS_ID : PA10
#define MX_USB_OTG_FS_ID_Pin                    PA10
#define MX_USB_OTG_FS_ID_GPIO_AF                GPIO_AF10_OTG_FS
#define MX_USB_OTG_FS_ID_GPIO_Speed             GPIO_SPEED_LOW
#define MX_USB_OTG_FS_ID_GPIO_PuPd              GPIO_NOPULL
#define MX_USB_OTG_FS_ID_GPIOx                  GPIOA
#define MX_USB_OTG_FS_ID_GPIO_Mode              GPIO_MODE_AF_PP
#define MX_USB_OTG_FS_ID_GPIO_Pin               GPIO_PIN_10

#if    ((RTE_USB_OTG_FS_DEVICE == 1) && (RTE_OTG_FS_VBUS_SENSING_PIN == 1))
// Pin USB_OTG_FS_VBUS : PA9
#define MX_USB_OTG_FS_VBUS_Pin                  PA9
#define MX_USB_OTG_FS_VBUS_GPIO_PuPd            GPIO_NOPULL
#define MX_USB_OTG_FS_VBUS_GPIOx                GPIOA
#define MX_USB_OTG_FS_VBUS_GPIO_Mode            GPIO_MODE_INPUT
#define MX_USB_OTG_FS_VBUS_GPIO_Pin             GPIO_PIN_9
#endif

#if    ((RTE_USB_OTG_FS_HOST == 1) && (RTE_OTG_FS_VBUS_PIN == 1))
// Pin USB_OTG_FS_VBUS_Power : GPIO pin
#define MX_USB_OTG_FS_VBUS_Power_Pin            1
#define MX_USB_OTG_FS_VBUS_Power_GPIO_PuPd      GPIO_NOPULL
#define MX_USB_OTG_FS_VBUS_Power_GPIOx          RTE_OTG_FS_VBUS_PORT
#define MX_USB_OTG_FS_VBUS_Power_GPIO_Mode      GPIO_MODE_OUTPUT_PP
#define MX_USB_OTG_FS_VBUS_Power_GPIO_Pin       MX_USB_OTG_FS_GPIO_PIN(RTE_OTG_FS_VBUS_BIT)
#ifndef    USB_OTG_FS_VBUS_Power_Pin_Active
#define    USB_OTG_FS_VBUS_Power_Pin_Active     RTE_OTG_FS_VBUS_ACTIVE
#endif
#endif

#if    ((RTE_USB_OTG_FS_HOST == 1) && (RTE_OTG_FS_OC_PIN == 1))
// Pin USB_OTG_FS_Overcurrent : GPIO pin
#define MX_USB_OTG_FS_Overcurrent_Pin           1
#define MX_USB_OTG_FS_Overcurrent_GPIO_PuPd     GPIO_NOPULL
#define MX_USB_OTG_FS_Overcurrent_GPIOx         RTE_OTG_FS_OC_PORT
#define MX_USB_OTG_FS_Overcurrent_GPIO_Mode     GPIO_MODE_INPUT
#define MX_USB_OTG_FS_Overcurrent_GPIO_Pin      MX_USB_OTG_FS_GPIO_PIN(RTE_OTG_FS_OC_BIT)
#define    USB_OTG_FS_Overcurrent_Pin_Active    RTE_OTG_FS_OC_ACTIVE
#endif

#elif  (defined(RTE_DEVICE_FRAMEWORK_CUBE_MX))  // #ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
#include "MX_Device.h"

#define CREATE_MX_SYMBOL(mx_def,ext)            MX_##mx_def##_##ext
#define MX_VAL(mx_def,ext)                      CREATE_MX_SYMBOL(mx_def,ext)

// Do basic CubeMX configuration check
#ifndef MX_USB_OTG_FS
#error  Enable USB_OTG_FS in STM32CubeMX!
#endif

#if     defined(MX_USB_OTG_FS_VBUS_Power)
// Pin USB_OTG_FS_VBUS_Power : GPIO pin
#define MX_USB_OTG_FS_VBUS_Power_Pin            1
#define MX_USB_OTG_FS_VBUS_Power_GPIO_PuPd      MX_VAL(MX_USB_OTG_FS_VBUS_Power, GPIO_PuPd)
#define MX_USB_OTG_FS_VBUS_Power_GPIOx          MX_VAL(MX_USB_OTG_FS_VBUS_Power, GPIOx)
#define MX_USB_OTG_FS_VBUS_Power_GPIO_Mode      MX_VAL(MX_USB_OTG_FS_VBUS_Power, GPIO_ModeDefaultOutputPP)
#define MX_USB_OTG_FS_VBUS_Power_GPIO_Pin       MX_VAL(MX_USB_OTG_FS_VBUS_Power, GPIO_Pin)
#ifndef    USB_OTG_FS_VBUS_Power_Pin_Active
#define    USB_OTG_FS_VBUS_Power_Pin_Active     0
#endif
#endif

#if     defined(MX_USB_OTG_FS_Overcurrent)
// Pin USB_OTG_FS_Overcurrent : GPIO pin
#define MX_USB_OTG_FS_Overcurrent_Pin           1
#define MX_USB_OTG_FS_Overcurrent_GPIO_PuPd     MX_VAL(MX_USB_OTG_FS_Overcurrent, GPIO_PuPd)
#define MX_USB_OTG_FS_Overcurrent_GPIOx         MX_VAL(MX_USB_OTG_FS_Overcurrent, GPIOx)
#define MX_USB_OTG_FS_Overcurrent_GPIO_Mode     MX_VAL(MX_USB_OTG_FS_Overcurrent, Mode)
#define MX_USB_OTG_FS_Overcurrent_GPIO_Pin      MX_VAL(MX_USB_OTG_FS_Overcurrent, GPIO_Pin)
#ifndef    USB_OTG_FS_Overcurrent_Pin_Active
#define    USB_OTG_FS_Overcurrent_Pin_Active    0
#endif
#endif

