Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_FS_STM32F4xx.h
#define OTG_FS_BASE           (AHB2PERIPH_BASE)
#define OTG_FS_DFIFO0_BASE    (OTG_FS_BASE + 0x01000U)
#define OTG_FS_DFIFO1_BASE    (OTG_FS_BASE + 0x02000U)
#define OTG_FS_DFIFO2_BASE    (OTG_FS_BASE + 0x03000U)
#define OTG_FS_DFIFO3_BASE    (OTG_FS_BASE + 0x04000U)
#define OTG_FS_DFIFO4_BASE    (OTG_FS_BASE + 0x05000U)
#define OTG_FS_DFIFO5_BASE    (OTG_FS_BASE + 0x06000U)
#define OTG_FS_DFIFO6_BASE    (OTG_FS_BASE + 0x07000U)
#define OTG_FS_DFIFO7_BASE    (OTG_FS_BASE + 0x08000U)

#define OTG_FS                ((OTG_FS_TypeDef *) OTG_FS_BASE)
#define OTG_FS_DFIFO0         (((uint32_t *) OTG_FS_DFIFO0_BASE) )
#define OTG_FS_DFIFO1         (((uint32_t *) OTG_FS_DFIFO1_BASE) )
#define OTG_FS_DFIFO2         (((uint32_t *) OTG_FS_DFIFO2_BASE) )
#define OTG_FS_DFIFO3         (((uint32_t *) OTG_FS_DFIFO3_BASE) )
#define OTG_FS_DFIFO4         (((uint32_t *) OTG_FS_DFIFO4_BASE) )
#define OTG_FS_DFIFO5         (((uint32_t *) OTG_FS_DFIFO5_BASE) )
#define OTG_FS_DFIFO6         (((uint32_t *) OTG_FS_DFIFO6_BASE) )
#define OTG_FS_DFIFO7         (((uint32_t *) OTG_FS_DFIFO7_BASE) )

// OTG_FS Host Channel
typedef struct {                        // Host Channel typedef (HC)
  union {
    volatile uint32_t HCCHAR;           // Channel Characteristics
    struct {
               uint32_t MPSIZ     : 11; // Endpoint Maximum Packet Size
               uint32_t EPNUM     :  4; // Endpoint Number
               uint32_t EPDIR     :  1; // Endpoint Direction
               uint32_t Reserved0 :  1; // Reserved
               uint32_t LSDEV     :  1; // Endpoint Low-speed
               uint32_t EPTYP     :  2; // Endpoint Type
               uint32_t MCNT      :  2; // Multicount
               uint32_t DAD       :  7; // Device Address
               uint32_t ODDFRM    :  1; // Periodic Transaction Odd Frame
               uint32_t CHDIS     :  1; // Channel Disable
      volatile uint32_t CHENA     :  1; // Channel Enable
    };
  };
  uint32_t Reserved1;                   // Reserved
  union {
    volatile uint32_t HCINT;            // Channel Interrupt
    struct {
      volatile uint32_t XFCR      :  1; // Transfer Completed
      volatile uint32_t CHH       :  1; // Channel Halted
      volatile uint32_t Reserved2 :  1; // Reserved
      volatile uint32_t STALL     :  1; // STALL Response Received Interrupt
      volatile uint32_t NAK       :  1; // NAK Response Received Interrupt
      volatile uint32_t ACK       :  1; // ACK Response Rece/Transmit Int
      volatile uint32_t Reserved3 :  1; // Reserved
      volatile uint32_t TXERR     :  1; // Transaction Error
      volatile uint32_t BBERR     :  1; // Babble Error
      volatile uint32_t FRMOR     :  1; // Frame Overrun
      volatile uint32_t DTERR     :  1; // Data Toggle Error
               uint32_t Reserved4 : 21; 
    };
  };
  union {
    uint32_t HCINTMSK;                  // Channel Interrupt Mask
    struct {
      uint32_t XFCRM     :  1;          // Transfer Completed Mask
      uint32_t CHHM      :  1;          // Channel Halted Mask
      uint32_t Reserved5 :  1;          // Reserved
      uint32_t STALLM    :  1;          // STALL Response Rece Interrupt Mask
      uint32_t NAKM      :  1;          // NAK Response Rece Interrupt Mask
      uint32_t ACKM      :  1;          // ACK Response Rece/Transmit Int Mask
      uint32_t Reserved6 :  1;          // Reserved
      uint32_t TXERRM    :  1;          // Transaction Error Mask
      uint32_t BBERRM    :  1;          // Babble Error Mask
      uint32_t FRMORM    :  1;          // Frame Overrun Mask
      uint32_t DTERRM    :  1;          // Data Toggle Error Mask
      uint32_t Reserved7 : 21; 
    };
  };
  union {
    volatile uint32_t HCTSIZ;           // Channel Transfer Size
    struct {
               uint32_t XFRSIZ    : 19; // Transfer Size
      volatile uint32_t PKTCNT    : 10; // Packet Count
               uint32_t DPID      :  2; // Data PID
               uint32_t Reserved8 :  1; // Reserved
    };
  };
  uint32_t Reserved9;                   // Reserved
  uint32_t Reserved10;                  // Reserved
  uint32_t Reserved11;                  // Reserved
} OTG_FS_HC;

#if   (defined (__CC_ARM))
  #pragma pop
#elif (defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif (defined (__GNUC__))
  #pragma GCC diagnostic pop
#endif

// OTG_FS control and status register (OTG_FS_GOTGCTL)
#define  OTG_FS_GOTGCTL_SRQSCS              ((uint32_t)    1U       )
#define  OTG_FS_GOTGCTL_SRQ                 ((uint32_t)    1U  <<  1)
#define  OTG_FS_GOTGCTL_HNGSCS              ((uint32_t)    1U  <<  8)
#define  OTG_FS_GOTGCTL_HNPRQ               ((uint32_t)    1U  <<  9)
#define  OTG_FS_GOTGCTL_HSHNPEN             ((uint32_t)    1U  << 10)
#define  OTG_FS_GOTGCTL_DHNPEN              ((uint32_t)    1U  << 11)
#define  OTG_FS_GOTGCTL_CIDSTS              ((uint32_t)    1U  << 16)
#define  OTG_FS_GOTGCTL_DBCT                ((uint32_t)    1U  << 17)
#define  OTG_FS_GOTGCTL_ASVLD               ((uint32_t)    1U  << 18)
#define  OTG_FS_GOTGCTL_BSVLD               ((uint32_t)    1U  << 19)

// OTG_FS interrupt register (OTG_FS_GOTGINT)
#define  OTG_FS_GOTGINT_SEDET               ((uint32_t)    1U  <<  2)
#define  OTG_FS_GOTGINT_SRSSCHG             ((uint32_t)    1U  <<  8)
#define  OTG_FS_GOTGINT_HNSSCHG             ((uint32_t)    1U  <<  9)
#define  OTG_FS_GOTGINT_HNGDET              ((uint32_t)    1U  << 17)
#define  OTG_FS_GOTGINT_ADTOCHG             ((uint32_t)    1U  << 18)
#define  OTG_FS_GOTGINT_DBCDNE              ((uint32_t)    1U  << 19)

// OTG_FS AHB configuration register (OTG_FS_GAHBCFG)
#define  OTG_FS_GAHBCFG_GINTMSK             ((uint32_t)    1U       )
#define  OTG_FS_GAHBCFG_TXFELVL             ((uint32_t)    1U  <<  7)
#define  OTG_FS_GAHBCFG_PTXFELVL            ((uint32_t)    1U  <<  8)

// OTG_FS USB configuration register (OTG_FS_GUSBCFG)
#define  OTG_FS_GUSBCFG_TOCAL_POS           ((uint32_t)           0U)
#define  OTG_FS_GUSBCFG_TOCAL_MSK           ((uint32_t)    7U       )
#define  OTG_FS_GUSBCFG_TOCAL(x)           (((uint32_t)    x        ) & OTG_FS_GUSBCFG_TOCAL_MSK)
#define  OTG_FS_GUSBCFG_PHYSEL              ((uint32_t)    1U  <<  6)
#define  OTG_FS_GUSBCFG_SRPCAP              ((uint32_t)    1U  <<  8)
#define  OTG_FS_GUSBCFG_HNPCAP              ((uint32_t)    1U  <<  9)
#define  OTG_FS_GUSBCFG_TRDT_POS            ((uint32_t)           10U)
#define  OTG_FS_GUSBCFG_TRDT_MSK            ((uint32_t) 0x0FU  << OTG_FS_GUSBCFG_TRDT_POS)
#define  OTG_FS_GUSBCFG_TRDT(x)            (((uint32_t)    x   << OTG_FS_GUSBCFG_TRDT_POS) & OTG_FS_GUSBCFG_TRDT_MSK)
#define  OTG_FS_GUSBCFG_FHMOD               ((uint32_t)    1U  << 29)
#define  OTG_FS_GUSBCFG_FDMOD               ((uint32_t)    1U  << 30)
#define  OTG_FS_GUSBCFG_CTXPKT              ((uint32_t)    1U  << 31)

