Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/OTG_FS_STM32F4xx.h
// OTG_FS device Vbus pulsing time register (OTG_FS_DVBUSPULSE)
#define  OTG_FS_DVBUSPULSE_DVBUSP_POS       ((uint32_t)           0U)
#define  OTG_FS_DVBUSPULSE_DVBUSP_MSK       ((uint32_t)0xFFFU       )
#define  OTG_FS_DVBUSPULSE_DVBUSP(x)       (((uint32_t)    x        ) & OTG_FS_DVBUSPULSE_DVBUSP)

// OTG_FS device IN endpoint FIFO emtpy interrupt mask register (OTG_FS_DIEPEMPMSK)
#define  OTG_FS_DIEPEMPMSK_INEPTXFEM_POS    ((uint32_t)           0U)
#define  OTG_FS_DIEPEMPMSK_INEPTXFEM_MSK    ((uint32_t)0xFFFFU      )
#define  OTG_FS_DIEPEMPMSK_INEPTXFEM(x)    (((uint32_t)    x        ) & OTG_FS_DIEPEMPMSK_INEPTXFEM_MSK)

// OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)
#define  OTG_FS_DIEPCTL0_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_FS_DIEPCTL0_MPSIZ_MSK          ((uint32_t)    3U       )
#define  OTG_FS_DIEPCTL0_MPSIZ(x)          (((uint32_t)    x        ) & OTG_FS_DIEPCTL0_MPSIZ_MSK)
#define  OTG_FS_DIEPCTL0_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_FS_DIEPCTL0_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_FS_DIEPCTL0_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_FS_DIEPCTL0_EPTYP_MSK          ((uint32_t)    3U  << OTG_FS_DIEPCTL0_EPTYP_POS)
#define  OTG_FS_DIEPCTL0_EPTYP(x)          (((uint32_t)    x   << OTG_FS_DIEPCTL0_EPTYP_POS) & OTG_FS_DIEPCTL0_EPTYP_MSK)
#define  OTG_FS_DIEPCTL0_STALL              ((uint32_t)    1U  << 21)
#define  OTG_FS_DIEPCTL0_TXFNUM_POS         ((uint32_t)           22U)
#define  OTG_FS_DIEPCTL0_TXFNUM_MSK         ((uint32_t) 0x0FU  << OTG_FS_DIEPCTL0_TXFNUM_POS)
#define  OTG_FS_DIEPCTL0_TXFNUM(x)         (((uint32_t)    x   << OTG_FS_DIEPCTL0_TXFNUM_POS) & OTG_FS_DIEPCTL0_TXFNUM_MSK)
#define  OTG_FS_DIEPCTL0_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_FS_DIEPCTL0_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_FS_DIEPCTL0_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_FS_DIEPCTL0_EPENA              ((uint32_t)    1U  << 31)

// OTG_FS device endpoint-x control register (OTG_FS_DIEPCTLx)
#define  OTG_FS_DIEPCTLx_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_FS_DIEPCTLx_MPSIZ_MSK          ((uint32_t)0x7FFU       )
#define  OTG_FS_DIEPCTLx_MPSIZ(x)          (((uint32_t)    x        ) & OTG_FS_DIEPCTLx_MPSIZ_MSK)
#define  OTG_FS_DIEPCTLx_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_FS_DIEPCTLx_EONUM_POS          ((uint32_t)           16U)
#define  OTG_FS_DIEPCTLx_EONUM              ((uint32_t)    1U  << OTG_FS_DIEPCTLx_EONUM_POS)
#define  OTG_FS_DIEPCTLx_DPID               ((uint32_t)    1U  << 16)
#define  OTG_FS_DIEPCTLx_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_FS_DIEPCTLx_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_FS_DIEPCTLx_EPTYP_MSK          ((uint32_t)    3U  << OTG_FS_DIEPCTLx_EPTYP_POS)
#define  OTG_FS_DIEPCTLx_EPTYP(x)          (((uint32_t)    x   << OTG_FS_DIEPCTLx_EPTYP_POS) & OTG_FS_DIEPCTLx_EPTYP_MSK)
#define  OTG_FS_DIEPCTLx_STALL              ((uint32_t)    1U  << 21)
#define  OTG_FS_DIEPCTLx_TXFNUM_POS         ((uint32_t)           22U)
#define  OTG_FS_DIEPCTLx_TXFNUM_MSK         ((uint32_t) 0x0FU  << OTG_FS_DIEPCTLx_TXFNUM_POS)
#define  OTG_FS_DIEPCTLx_TXFNUM(x)         (((uint32_t)    x   << OTG_FS_DIEPCTLx_TXFNUM_POS) & OTG_FS_DIEPCTLx_TXFNUM_MSK)
#define  OTG_FS_DIEPCTLx_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_FS_DIEPCTLx_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_FS_DIEPCTLx_SD0PID             ((uint32_t)    1U  << 28)
#define  OTG_FS_DIEPCTLx_SEVNFRM            ((uint32_t)    1U  << 28)
#define  OTG_FS_DIEPCTLx_SODDFRM            ((uint32_t)    1U  << 29)
#define  OTG_FS_DIEPCTLx_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_FS_DIEPCTLx_EPENA              ((uint32_t)    1U  << 31)

// OTG_FS device control OUT endpoint 0 control register (OTG_FS_DOEPCTL0)
#define  OTG_FS_DOEPCTL0_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_FS_DOEPCTL0_MPSIZ_MSK          ((uint32_t)    3U       )
#define  OTG_FS_DOEPCTL0_MPSIZ(x)          (((uint32_t)    x        ) & OTG_FS_DOEPCTL0_MPSIZ_MSK)
#define  OTG_FS_DOEPCTL0_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_FS_DOEPCTL0_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_FS_DOEPCTL0_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_FS_DOEPCTL0_EPTYP_MSK          ((uint32_t)    3U  << OTG_FS_DOEPCTL0_EPTYP_POS)
#define  OTG_FS_DOEPCTL0_EPTYP(x)          (((uint32_t)    x   << OTG_FS_DOEPCTL0_EPTYP_POS) & OTG_FS_DOEPCTL0_EPTYP_MSK)
#define  OTG_FS_DOEPCTL0_SNPM               ((uint32_t)    1U  << 20)
#define  OTG_FS_DOEPCTL0_STALL              ((uint32_t)    1U  << 21)
#define  OTG_FS_DOEPCTL0_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_FS_DOEPCTL0_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_FS_DOEPCTL0_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_FS_DOEPCTL0_EPENA              ((uint32_t)    1U  << 31)

// OTG_FS device endpoint-x control register (OTG_FS_DOEPCTLx)
#define  OTG_FS_DOEPCTLx_MPSIZ_POS          ((uint32_t)           0U)
#define  OTG_FS_DOEPCTLx_MPSIZ_MSK          ((uint32_t)0x7FFU       )
#define  OTG_FS_DOEPCTLx_MPSIZ(x)          (((uint32_t)    x        ) & OTG_FS_DOEPCTLx_MPSIZ_MSK)
#define  OTG_FS_DOEPCTLx_USBAEP             ((uint32_t)    1U  << 15)
#define  OTG_FS_DOEPCTLx_EONUM_POS          ((uint32_t)           16U)
#define  OTG_FS_DOEPCTLx_EONUM              ((uint32_t)    1U  << OTG_FS_DOEPCTLx_EONUM_POS)
#define  OTG_FS_DOEPCTLx_DPID               ((uint32_t)    1U  << 16)
#define  OTG_FS_DOEPCTLx_NAKSTS             ((uint32_t)    1U  << 17)
#define  OTG_FS_DOEPCTLx_EPTYP_POS          ((uint32_t)           18U)
#define  OTG_FS_DOEPCTLx_EPTYP_MSK          ((uint32_t)    3U  << OTG_FS_DOEPCTLx_EPTYP_POS)
#define  OTG_FS_DOEPCTLx_EPTYP(x)          (((uint32_t)    x   << OTG_FS_DOEPCTLx_EPTYP_POS) & OTG_FS_DOEPCTLx_EPTYP_MSK)
#define  OTG_FS_DOEPCTLx_SNPM               ((uint32_t)    1U  << 20)
#define  OTG_FS_DOEPCTLx_STALL              ((uint32_t)    1U  << 21)
#define  OTG_FS_DOEPCTLx_CNAK               ((uint32_t)    1U  << 26)
#define  OTG_FS_DOEPCTLx_SNAK               ((uint32_t)    1U  << 27)
#define  OTG_FS_DOEPCTLx_SD0PID             ((uint32_t)    1U  << 28)
#define  OTG_FS_DOEPCTLx_SEVNFRM            ((uint32_t)    1U  << 28)
#define  OTG_FS_DOEPCTLx_SD1PID             ((uint32_t)    1U  << 29)
#define  OTG_FS_DOEPCTLx_SODDFRM            ((uint32_t)    1U  << 29)
#define  OTG_FS_DOEPCTLx_EPDIS              ((uint32_t)    1U  << 30)
#define  OTG_FS_DOEPCTLx_EPENA              ((uint32_t)    1U  << 31)

